#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_api_management_logger.apim_logger will be destroyed
  # (because azurerm_api_management_logger.apim_logger is not in configuration)
  - resource "azurerm_api_management_logger" "apim_logger" {
      - api_management_name = "dx-d-itn-playground-pg-apim-01" -> null
      - buffered            = true -> null
      - id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/loggers/pg-apim-logger" -> null
      - name                = "pg-apim-logger" -> null
      - resource_group_name = "dx-d-itn-test-rg-01" -> null
      - resource_id         = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Insights/components/dx-d-playground-appi-01" -> null
        # (1 unchanged attribute hidden)

      - application_insights {
          - connection_string   = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.apim.azurerm_api_management_diagnostic.this[0] will be created
  + resource "azurerm_api_management_diagnostic" "this" {
      + always_log_errors         = true
      + api_management_logger_id  = (known after apply)
      + api_management_name       = "dx-d-itn-playground-pg-apim-01"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = (known after apply)
      + resource_group_name       = "dx-d-itn-test-rg-01"
      + sampling_percentage       = 100
      + verbosity                 = "information"

      + backend_request (known after apply)

      + backend_response (known after apply)

      + frontend_request (known after apply)

      + frontend_response (known after apply)
    }

  # module.apim.azurerm_api_management_logger.this[0] will be created
  + resource "azurerm_api_management_logger" "this" {
      + api_management_name = "dx-d-itn-playground-pg-apim-01"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "dx-d-itn-playground-pg-apim-01-logger"
      + resource_group_name = "dx-d-itn-test-rg-01"
      + resource_id         = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Insights/components/dx-d-playground-appi-01"

      + application_insights {
          + connection_string = (sensitive value)
        }
    }

  # module.app_service.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "100"
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
            # (6 unchanged elements hidden)
        }
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-fe-app-01"
        name                                           = "dx-d-itn-playground-fe-app-01"
        tags                                           = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.to_do_api.azurerm_api_management_api_policy.policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "policy" {
        id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service backend-id="to-do-api-azure-function" />
          - 		<!-- Append base-path, if defined, before invoking the backend -->
          - 		<choose>
          - 			<when condition="@(System.String.IsNullOrEmpty("api"))"></when>
          - 			<otherwise>
          - 				<rewrite-uri template="@(System.String.Concat("api/", context.Request.Url.Path))" />
          - 			</otherwise>
          - 		</choose>
          - 		<set-header name="x-functions-key" exists-action="override">
          - 			<value>{{to-do-api-function-key}}</value>
          - 		</set-header>
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>*</origin>
          - 			</allowed-origins>
          - 			<allowed-methods>
          - 				<method>*</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>*</header>
          - 			</allowed-headers>
          - 			<expose-headers>
          - 				<header>*</header>
          - 			</expose-headers>
          - 		</cors>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +     <base />
          +     <set-backend-service backend-id="to-do-api-azure-function" />
          + 
          +      <!-- Append base-path, if defined, before invoking the backend -->
          +     <choose>
          +       <when condition='@(System.String.IsNullOrEmpty("api"))'>
          +       </when>
          +       <otherwise>
          +         <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
          +       </otherwise>
          +     </choose>
          + 
          +     <set-header name="x-functions-key" exists-action="override">
          +       <value>{{to-do-api-function-key}}</value>
          +     </set-header>
          + 
          +     <cors>
          +       <allowed-origins>
          +           <origin>*</origin>
          +       </allowed-origins>
          +       <allowed-methods>
          +           <method>*</method>
          +       </allowed-methods>
          +       <allowed-headers>
          +           <header>*</header>
          +       </allowed-headers>
          +       <expose-headers>
          +           <header>*</header>
          +       </expose-headers>
          +     </cors>
          +   </inbound>
          +   <outbound>
          +     <base />
          +   </outbound>
          +   <backend>
          +     <base />
          +   </backend>
          +   <on-error>
          +     <base />
          +   </on-error>
            </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
